---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.LoopOnBestFitSelfIntersects
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.LoopOnBestFitSelfIntersects

A face loop whose projection of the best-fit-plane self-intersects.
 Associated numbers are face, loop, and two segments
 indices respectively.